
[
    {
        "designation": "Data Scientist at Mphasis | LoanIQ Enthusiast",
        "name": "Mayank Shah",
        "avatar": "https://media-exp2.licdn.com/dms/image/C5603AQGHCXdrYqwk7Q/profile-displayphoto-shrink_800_800/0/1643015697188?e=1663200000&v=beta&t=kIlYBz1Y93eOT6iercJZRDHjXVLgdIybQdDrWpVXHrc",
        "review": "I have worked with many professionals throughout my stint at NatWest Group, but Sourav is highly experienced, organized and focused person. He is supportive and keen to address any impediments impacting individual or team work. He has a great business acumen, domain knowledge, excellent client connect, and flexible enough in work environments. He has juggled up multiple responsibilities at work simultaneously with poise & grace. I count his determination, commitment and clarity of thoughts at work and outside. Working with him in the organization feels like joy and fun as we connect over official and unofficial celebrations."
    
    },
    {
        "designation": "Vice President at JPMorgan Chase & Co.",
        "name": "Stuart Hutton",
        "avatar": "https://media-exp2.licdn.com/dms/image/C4D03AQGrxWatz7ddfA/profile-displayphoto-shrink_800_800/0/1627493542512?e=1663200000&v=beta&t=5817S7aYDnzyzrD0e3YPSkc1BmQ9PECBWMG0OV03wz0",
         "review": "I have worked with Sourav for the last 18 months on a project for a demanding customer. I have found him to be a true professional in all aspects of his work. He understands the pressures placed on us by our client, the need for a speedy, but accurate response and is not afraid to put in the commitment required to meet the clients needs. He has a clear understanding of the product, knows what questions to ask when resolving problems and is not afraid to challenge the process to deliver what the client needs. I would have no problem with working with him again in the future, and would whole heartedly recommend him to any project that we undertake. I would love to have 10 Souravs working with me!"
    },
    {
        "designation": "Function Head - Rosmerta Digital @Rosmerta Technologies",
        "name": "Krishnendu Ghosh",
        "avatar": "https://media-exp2.licdn.com/dms/image/D4D35AQGKIi8BApFHzQ/profile-framedphoto-shrink_800_800/0/1657562377374?e=1658170800&v=beta&t=42mFMNs2t8QkeAk34rcn00TUbaY4Pp838IuSUzdXUy8",
        "review": "I rarely come across real talents who stand out like Sourav. He is a highly dependable and dedicated associate. I count his determination, commitment and clarity of thought. In his short span of carrier, he has a great business acumen, technical, domain knowledge and excellent client connect. He has exemplary understanding of requirements, process, maturity, overall timeliness and connect with his peers and teammates. His learning attitude towards any technology is appreciable."
    },

    {
        "designation": "Manager, Agile Coach at Accenture",
        "name": "Ankit Rawat",
        "avatar": "https://media-exp2.licdn.com/dms/image/C4E03AQF1ytx4MlKPpA/profile-displayphoto-shrink_800_800/0/1655954229594?e=1663200000&v=beta&t=NDS6GvGIqpvwaq-pNXM0lUBIf0D1NaleXcXHCFwJdAI",
        "review": "Sourav is one of the most diligent and hard-working Loan IQ consultant I had worked with. He is very cool with his work and can handle any critical situations. He has a very sound knowledge of the Product and also helps in making stuffs clear to others.I was closely working with him for a tough client using Loan IQ and saw him smoothly handling every situation. Apart from professional aspect, Sourav is also a wonderful as a person."
    }
   
]